#include<stdio.h>
#include<stdint.h>
int main(){
	
	// &运算： 两组二进制进行 & 操作，如果两个二进制位是1，那么结果就是1，否则是：0
	
	/*
	  3： 0000 0011 
	  5:  0000 0101
	  --------------
	      0000 0001
	*/
	int8_t a = 3 & 5;
	printf("a=%d\n" ,a );    // 1
	
	/*
	  -23:
		  1001 0111
		  1110 1000
		  1110 1001
	  
	  -35:
		  1010 0011
		  1101 1100
		  1101 1101
	  
	  1110 1001
	  1101 1101
	  ----------
	  1100 1001【负数补码】 ----> 1100 1000【负数反码】 ----> 1011 0111【负数原码】
	  
	*/
	int8_t b = -23 & -35;
	printf("b=%d\n" ,b );    // -55
	
	
	

	
	return 0;
}
